#+TITLE: C语言编程
#+AUTHOR: LavenLiu
#+DATE: 2015-09-27
#+EMAIL: ldczz2008@163.com 

#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt]
#+LaTeX_HEADER: \usepackage[top=2.1cm,bottom=2.1cm,left=2.1cm,right=2.1cm]{geometry}
#+LaTeX_HEADER: \setmainfont[Mapping=tex-text]{Times New Roman}
#+LaTeX_HEADER: \setsansfont[Mapping=tex-text]{Tahoma}
#+LaTeX_HEADER: \setmonofont{Courier New}
#+LaTeX_HEADER: \setCJKmainfont[BoldFont={Adobe Heiti Std},ItalicFont={Adobe Kaiti Std}]{Adobe Song Std}
#+LaTeX_HEADER: \setCJKsansfont{Adobe Heiti Std}
#+LaTeX_HEADER: \setCJKmonofont{Adobe Fangsong Std}
#+LaTeX_HEADER: \punctstyle{hangmobanjiao}
#+LaTeX_HEADER: \usepackage{color,graphicx}
#+LaTeX_HEADER: \usepackage[table]{xcolor}
#+LaTeX_HEADER: \usepackage{colortbl}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \usepackage[bf,small,indentafter,pagestyles]{titlesec}
#+LaTeX_HEADER: \renewcommand{\baselinestretch}{1.38}
#+LaTeX_HEADER: \setlength{\baselineskip}{20pt}

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/style2.css" />

#+OPTIONS: ^:nil

** 一个简单的C程序
   #+BEGIN_SRC C
/*
 * filename: pun.c 
 */

#include <stdio.h>

int main(int argc, char *argv[])
{
    printf("To C, or not to C: that is a question.\n");
    return 0;
}
   #+END_SRC

   #+RESULTS:
   | To C | or not to C: that is a question. |

   编辑完毕源代码，接下来就可以把程序转化为机器可以执行的形式。对于C程
   序来说，通常包含下列3个步骤：
   1. *预处理* 首先会把程序送给预处理器（怕热processor）。预处理器执行
      以#开头的命令（通常称为指令，directive）。预处理器有点类似编辑器，
      它可以给程序添加内容，也可以对程序进行修改。
   2. *编译* 修改后的程序现在可以进入编译器（compiler）了。编译器会把
      程序翻译成机器指令（即目标代码：object code）。然而，这样的程序
      还是不可以运行的。
   3. *链接* 在最后一个步骤中，链接器（linker）把由编译器产生的目标代
      码和任何其他附加代码整合在一起，这样才最终产生了完全可执行的程序。
      这些附加代码包括很多程序中用到的库函数（如printf函数）。

   接下来编译和链接pun.c源程序，
   #+BEGIN_SRC sh
gcc -Wall -o pun pun.c
# -Wall选项可以使gcc比平常更彻底地检查程序并且警告可能发生的问题
   #+END_SRC
** 变量和赋值
   声明变量，
   #+BEGIN_SRC C
int height;
float profit;
   #+END_SRC

   变量赋值，
   #+BEGIN_SRC C
height = 8;
length = 12;
width = 10;
   #+END_SRC

   一个源程序dweight.c，
   #+BEGIN_SRC C
/* Computes the dimensional weight of a 12x10x8 box */

#include <stdio.h>

int main(int argc, char *argv[])
{
    int height, length, width, volume, weight;

	height = 8;
	length = 12;
	width = 10;
	volume = height * length * width;
	weight = (volume + 165) / 166;

	printf("Dimensions: %dx%dx%d\n", length, width, height);
	printf("Volume (cubic inches): %d\n", volume);
	printf("Dimensional weight (pounds): %d\n", weight);
	
    return 0;
}
   #+END_SRC

   #+RESULTS:
   | Dimensions: | 12x10x8 |           |     |
   | Volume      | (cubic  | inches):  | 960 |
   | Dimensional | weight  | (pounds): |   6 |
